app/controllers/api/v1/tickets_controller.rb

  def create
    @ticket = Ticket.new(tickets_params)
    @ticket.tags = tickets_params[:tags]
    if @ticket.save
---
INSERT INTO `tags` (`tag_name`, `count`, `created_at`, `updated_at`) VALUES ('1', 1, '2022-08-25 21:42:30.943022', '2022-08-25 21:42:30.943022')
INSERT INTO `tickets` (`user_id`, `title`, `received_at`, `created_at`, `updated_at`) VALUES (1, 'test3', '2022-08-26 00:19:48.784595', '2022-08-26 00:19:48.784651', '2022-08-26 00:19:48.784651')