app/models/tag.rb

SELECT tag_name, Max(count) as count FROM `tags` GROUP BY `tags`.`tag_name` ORDER BY `tags`.`id` ASC LIMIT 1
---
  def send_webhook
    tag = Tag.select("tag_name, Max(count) as count").group(:id).first