app/models/ticket.rb

  def create_tags
    return unless tags.present?
    tags.map(&:downcase!)

    existing_tags = Tag.where(tag_name: tags)
    tags.each do |tag|
      t = existing_tags.select { |t| t.tag_name == tag }&.first
      t.present? ? t.update(count: t.count + 1) : Tag.create(tag_name: tag, count: 1)
---
SELECT `tags`.* FROM `tags` WHERE `tags`.`tag_name` = 'bye'
SELECT `tags`.* FROM `tags` WHERE `tags`.`tag_name` IN ('1', '2', '3', '4', '5')
INSERT INTO `tags` (`tag_name`, `count`, `created_at`, `updated_at`) VALUES ('1', 1, '2022-08-27 18:39:12.939416', '2022-08-27 18:39:12.939416')
UPDATE `tags` SET `tags`.`count` = 11, `tags`.`updated_at` = '2022-08-26 00:06:00.336380' WHERE `tags`.`id` = 36